/* (nem mentettél még) */
"(unsaved)" = "(nem mentettél még)";

/* A newer version (%@) is available. Do you want to download it? in checkForUpdate */
"A newer version (%@) is available. Do you want to download it?" = "Megjelent egy újabb verzió (%@). Letöltöd?";

/* Advanced preferences toolbar item Label */
"Advanced" = "Speciális";

/* Advanced Find */
"Advanced Find" = "Speciális keresés";

/* The name for the all documents project */
"All documents" = "Minden dokumentum";

/* Appearance preferences toolbar item Label */
"Appearance" = "Megjelenés";

/* Ask if you are sure that you want to delete %i occurrences of %@ in ask-if-sure-you-want-to-replace-in-advanced-find-sheet */
"Are you sure that you want to delete %i occurrences of %@?" = "Biztos vagy benne, hogy törlöd a(z)  “%2$@” mind a(z) %1$i megjelenését?";

/* Ask if you are sure that you want to delete the one occurrence of %@ in ask-if-sure-you-want-to-replace-in-advanced-find-sheet */
"Are you sure that you want to delete the one occurrence of %@?" = "Biztos vagy benne, hogy törlöd a következőt: “%@\"?";

/* Ask if you are sure that you want to replace %i occurrences of %@ with %@ in ask-if-sure-you-want-to-replace-in-advanced-find-sheet */
"Are you sure that you want to replace %i occurrences of %@ with %@?" = "Biztos vagy benne, hogy mind a(z) “%2$@” kifejezést mind a(z) %1$i alkalommal a(z) “%3$@” kifejezésre cseréled?";

/* Ask if you are sure that you want to replace one occurrence of %@ with %@ in ask-if-sure-you-want-to-replace-in-advanced-find-sheet */
"Are you sure that you want to replace one occurrence of %@ with %@?" = "Biztos vagy benne, hogy a(z) “%1$@” kifejezést a(z) “%2$@” kifejezésre cseréled?";

/* Ask if you are sure you want to download preferences for Smultron from your iDisk and replace your current settings in Download-preferences-from-iDisk sheet */
"Are you sure you want to download preferences for Smultron from your iDisk and replace your current settings?" = "Biztosan lecseréled a saját beállításaidat az iDisk-ről letöltöttre?";

/* Ask if they are sure they want to install the command-line utility in Install-command-line-utility sheet */
"Are you sure you want to install the command-line utility?" = "Biztosan telepíted a parancssori alkalmazásokat?";

/* Ask if you are sure you want to revert this document in Revert-sheet */
"Are you sure you want to revert this document?" = "Biztosan visszaállítod a dokumentumot?";

/* Ask if you are sure you want to upload your current preferences for Smultron and replace the preference file on your iDisk (if it exists) in Upload-preferences-to-iDisk sheet */
"Are you sure you want to upload your current preferences for Smultron and replace the preference file on your iDisk (if it exists)?" = "Biztosan fel akarod tölteni a beállításaidat az iDisk-re, ezzel törölve az ottani beállításaidat (ha van)?";

/* Authenticate */
"Authenticate" = "Azonosítás";

/* The name for bytes in the info window */
"bytes" = "bájt";

/* Cancel-button */
"Cancel" = "Mégsem";

/* Name for undo Change Encoding */
"Change Encoding" = "Karakterkódolás változtatás";

/* Name for undo Change Line Endings */
"Change Line Endings" = "Sorvége változtatás";

/* Indicate that they should change the preferences to a different encoding or be careful to check the content if you choose to open it in Check-encoding sheet */
"Change the preferences to a different encoding or be careful to check the content if you choose to open it" = "Állíts be másik karakterkódolást, vagy légy óvatos, ha így nézed meg a fájlt";

/* Indicate that they should choose something that is not a folder or change the settings in Preferences so that all items in a folder are opened in Open-file-is-a-directory sheet */
"Choose something that is not a folder or change the settings in Preferences so that all items in a folder are opened" = "Ne könyvtárat válassz, vagy állítsd be, hogy könyvtár választás esetén annak teljes tartalma betöltődjön";

/* Close */
"Close" = "Bezár";

/* Close Split */
"Close Split" = "Megosztás megszüntetése";

/* Collection */
"Collection" = "Gyüjtemény";

/* Command ran successfully in runAction */
"Command ran successfully" = "Parancs sikeresen végrehajtva";

/* Commands */
"Commands" = "Parancsok";

/* The word to indicate that the filename is a copy in Save-A-Copy-As save-panel */
"copy" = "másolat";

/* Indicate that you could not connect properly to your iDisk in Can't-connect-to-iDisk sheet */
"Could not connect properly to your iDisk" = "Nem sikerült csatlakozni az iDisk-hez";

/* Could not find a match for search-string %@ in Advanced Find */
"Could not find a match for search-string %@" = "Nem találtam a következő kifejezést: “%@”";

/* Indicate that a Smultron preference-file could not be found on your iDisk in Can't-find-iDisk-preferences-file sheet */
"Could not find a Smultron preference-file on your iDisk" = "Nem találtam Smultron beállításokat tartalmazó file-t az iDisk-en";

/* Indicate that the program could not find the syntax file to match this document in Could-not-find-syntax-file sheet */
"Could not find the syntax file to match this document" = "Nem találtam szintaxis file-t, ami illeszkedne erre a dokumentumra";

/* Indicate that the local Preferences file could not be found in Can't-find-local-preferences-file sheet */
"Could not find your local preferences file" = "A helyben tárolt (lokális) beállítások file-t nem találtam";

/* Indicate that the program could not overwrite the file %@ because it has been removed in File-has-been-removed sheet */
"Could not overwrite the file %@ because it has been removed" = "Nem sikerült felülírni a(z) “%@” file-t, mert az el lett távolítva";

/* Delete-button */
"Delete" = "Töröl";

/* Ask whether they want to ignore the updates the other application has made or reload the document and destroy any changes you have made to this document Document-has-been-updated-alert sheet */
"Do you want to ignore the updates the other application has made or reload the document and destroy any changes you have made to this document?" = "Elveted a másik program által eszközölt módosításokat, vagy újratöltsem a fájlt, ezzel törölve a saját módosításaidat?";

/* Ask whether they want to ignore the updates the other application has made or reload the document Document-has-been-updated-alert sheet */
"Do you want to ignore the updates the other application has made or reload the document?" = "Elveted a másik program által eszközölt módosításokat, vagy újratöltsem a fájlt?";

/* Ask if you want to open %@ as a project or as a text file in Ask-if-project-or-file sheet */
"Do you want to open %@ as a project or as a text file" = " Projektként, vagy szövegfájlként nyitod meg: “%@”";

/* Don't Line Wrap Text */
"Don't Line Wrap Text" = "Ne legyenek a sorok törve";

/* Don't Save-button in Close-sheet */
"Don't Save" = "Ne legyen mentés";

/* Download */
"Download" = "Letöltés";

/* Encoding, in the status bar */
"Encoding" = "Kódolás";

/* Found %i matches for search-string %@ in Advanced Find */
"Found %i matches for search-string %@" = "%1$i megfelelést találtam a következő kifejezésre: “%2$@”";

/* Found one match for search-string %@ in Advanced Find */
"Found one match for search-string %@" = "Egy megfelelést találtam: “%@”";

/* Function */
"Function" = "Funkció";

/* General preferences toolbar item Label */
"General" = "Általános";

/* Hide Documents List in View menu */
"Hide Documents List" = "Dokumentum lista elrejtése";

/* Hide Invisible Characters in View-menu */
"Hide Invisible Characters" = "Láthatatlan karakterek elrejtése";

/* Hide Line Numbers */
"Hide Line Numbers" = "Sorszámok elrejtése";

/* Hide Projects toolbar item Label */
"Hide Projects" = "Projektek elrejtése";

/* Hide Projects Drawer in View menu */
"Hide Projects Drawer" = "Projekt fiók elrejtése";

/* Hide Status Bar in View-menu */
"Hide Status Bar" = "Állapot sor elrejtése";

/* Hide Syntax Colours */
"Hide Syntax Colours" = "Szinezés elrejtése";

/* Hide Tab Bar in View menu */
"Hide Tab Bar" = "Tabok elrejtése";

/* Indicate that if you choose Install smultron will be installed in /usr/bin and its man page in /usr/share/man/man1 and you can use it directly in the Terminal (you may need to authenticate twice with an administrators username and password). Otherwise you can choose to place all the files you need on the desktop and install it manually. in Install-command-line-utility sheet */
"If you choose Install smultron will be installed in /usr/bin and its man page in /usr/share/man/man1 and you can use it directly in the Terminal (you may need to authenticate twice with an administrators username and password). Otherwise you can choose to place all the files you need on the Desktop and install it manually." = "Ha a telepítést választod, a smultron a  /usr/bin könyvtárba, a man pedig a /usr/share/man/man1 könyvtárba kerül. Ezeket a Terminálból közvetlenül is el tudod érni. Ha nem telepíted, akkor ezeket manuálisan kell a megfelelő könyvtárakban elhelyezned.";

/* Indicate that if you want you can try to authenticate with an administrators username and password */
"If you want you can try to authenticate with an administrators username and password" = "Ha gondolod, próbáld meg egy adminisztrátori felhasználói névvel és jelszóval";

/* Ignore-button in Document-has-been-updated-alert sheet */
"Ignore" = "Nem érdekel";

/* The name for the collection that holds the snippets that are imported from version 1 */
"Imported Snippets" = "Importált Snippletek";

/* Info */
"Info" = "Infó";

/* Install-button in Install-command-line-utility sheet */
"Install" = "Telepít";

/* Indicate that it seems as if you do not have permission to open the file %@ in Not-enough-permission-to-open sheet */
"It seems as if you do not have permission to open the file %@" = "Úgy tűnik nincs jogod megnyitni a(z) “%@” file-t";

/* Indicate that it seems as if you do not have permission to save the file %@ in Not-enough-permission-in-data-save sheet */
"It seems as if you do not have permission to save the file %@" = "Úgy tűnik nincs jogod menteni a(z) “%@” file-t";

/* Saved, in the status bar */
"Saved" = "Elmentve";

/* Length, in the status bar */
"Length" = "Hossz";

/* Line Wrap Text */
"Line Wrap Text" = "Sortöréses szöveg";

/* Line Wrap / Don't Line Wrap toolbar item Palette Label */
"Line Wrap / Don't Line Wrap" = "Sorok törve / Sorok folytonosak";

/* Live Find */
"Live Find" = "Élő keresés";

/* Indicate that they should Make sure that your .Mac settings are correct and you are connected to the internet */
"Make sure that your .Mac settings are correct and you are connected to the internet" = "Ellenőrízd, hogy helyesek-e a .Mac beállításaid, s hogy csatlakoztál-e az internethez";

/* New */
"New" = "Új";

/* Indicate that no document is selected for the dummy view */
"No document selected" = "Nem választottál dokumentumot";

/* Not applicable in insertAllFunctionsIntoMenu */
"Not applicable" = "Nem alkalmazható";

/* OK-button */
"OK" = "OK";

/* The name for the collection that holds the old snippets that are imported from version 1 */
"Old Snippets" = "Régi sznippet";

/* Open */
"Open" = "Megnyit";

/* OpenSave preferences toolbar item Label */
"Open & Save" = "Megnyitás és mentés";

/* Please be patient. It could take a while. in preparing to print */
"Please be patient. It could take a while." = "Türelem. Eltarthat egy ideig.";

/* Indicate that they should please change the preferences if you want any information in the bar in Show-status-bar-action */
"Please change the preferences if you want any information in the bar" = "Változtasd meg a beállításaidat, ha bármi információt szeretnél látni az állapot soron";

/* Indicate that they should please check if you've moved or deleted the original file in Revert-file-doesn't-exist sheet */
"Please check if you've moved or deleted the original file" = "Kérlek ellenőrízd, nem helyezted-e át, vagy törölted le az eredeti fájlt";

/* Indicate that they should please check the installation of Smultron and that they have a preference-file at <your home folder>/Library/Preferences/org.smultron.Smultron.plist in Can't-find-local-preferences-file sheet */
"Please check the installation of Smultron and that you have a preference-file at <your home folder>/Library/Preferences/org.smultron.Smultron.plist" = "Ellenőrízd a telepítést, s hogy  a <Te home könyvtárad>/Library/Preferences/org.smultron.Smultron.plist létezik-e";

/* Indicate that they should Please check the installation of the application and the preferences in Could-not-find-syntax-file sheet */
"Please check the installation of the application and the preferences" = "Ellenőrízd a program telepítését a beállításoknál";

/* Indicate that they should please check the permissions for the file and the enclosing folder and try again in Unknown-error-when-opening-with-authentication sheet */
"Please check the permissions for the file and the enclosing folder and try again" = "Ellenőrízd a fájl és az azt tartalmazó könyvtár jogosultságait és próbáld meg újra";

/* Please consider exporting the snippets first. There is no undo available. when deleting a collection */
"Please consider exporting the snippets first. There is no undo available." = "Kérlek gondold át a snippetek exportálását. Nincs visszavonási lehetőség.";

/* Indicate that they should find it at different location by choosing Open%C in the File menu Open-file-does-not-exist sheet */
"Please find it at a different location by choosing Open%C in the File menu" = "Próbáld meg másik helyen a fájl menü Megnyitás%C funkciójával";

/* Indicate that they should please make sure that they have a file called org.smultron.Smultron.plist in the folder /Documents/Smultron Preferences on their iDisk and that their .Mac settings are correct and that they are connected to the internet in Can't-find-iDisk-preferences-file sheet */
"Please make sure that you have a file called org.smultron.Smultron.plist in the folder /Documents/Smultron Preferences/ on your iDisk and that your .Mac settings are correct and that you are connected to the internet" = "Kérlek ellenőrízd, hogy az org.smultron.Smultron.plist a /Documents/Smultron Preferences/ könyvtárban van-e a .Mac iDisk-eden, s hogy minden beaáálításod rendben van, illetve, hogy csatlakozol-e az internetre";

/* Indicate that they should make sure that their .Mac settings are correct and that they are connected to the internet in Can't-connect-to-iDisk sheet */
"Please make sure that your .Mac settings are correct and that you are connected to the internet" = "Ellenőrizd, hogy a .Mac beállításaid helyesek, s hogy kapcsolódsz-e az internetre";

/* Indicate that they should try to save in a different location */
"Please save it at a different location" = "Kérlek másik helyre mentsd";

/* Indicate that they should try to save at a different location with Save As%C in File menu in Path-is-a-directory sheet */
"Please save it at a different location with Save As%C in the File menu" = "Próbáld elmenteni másik helyre a mentés másként%C funkcióval a fájl menüben";

/* Indicate that you should try a different location with Save As%C in the File menu in Unknown-error-when-saving-with-authentication sheet */
"Please try a different location with Save As%C in the File menu" = "Próbáld elmenteni másik helyre a mentés másként%C funkcióval a fájl menüben";

/* Indicate that you should try a different location with Save As%C in the File menu or check the permissions of the file and the enclosing folder and try again in Unknown-error-when-saving sheet */
"Please try a different location with Save As%C in the File menu or check the permissions of the file and the enclosing folder and try again" = "Próbáld elmenteni másik helyre a fájl menü Mentés másként%C funkciójával, vagy ellenőrizd a könyvtár jogosultságait.";

/* Indicate that they should try to save in a different location with in Unknown-error-when-data-saving sheet */
"Please try to save in a different location" = "Próbáld elmenteni másik helyre";

/* Indicate that they should please use Save As%C in the File menu in File-has-been-removed sheet */
"Please use Save As%C in the File menu" = "Kérlek használd a Mentés másként%C funkciót a fájl menüben";

/* Position, in the status bar */
"Position" = "Pozició";

/* Preferences */
"Preferences" = "Beállítások";

/* Preparing the document for printing in preparing to print */
"Preparing the document for printing" = "Dokumentum előkészítése nyomtatásra";

/* Press the Escape-button on the keyboard to return from the full screen mode in Show Document In Full Screen */
"Press the Escape-button on the keyboard to return from the full screen mode" = "Escape billentyűvel visszaléphetsz a teljes képernyős nézetről";

/* Preview */
"Preview" = "Előnézet";

/* Project-button in Ask-if-project-or-file sheet */
"Project" = "Projekt";

/* Put On Desktop-button in Install-command-line-utility sheet */
"Put On Desktop" = "Asztalra helyez";

/* Reload-button in Document-has-been-updated-alert sheet */
"Reload" = "Újratöltés";

/* Remember that you can always Undo any changes in ask-if-sure-you-want-to-replace-in-advanced-find-sheet */
"Remember that you can always Undo any changes" = "NE felejtsd el, hogy mindig van lehetőség visszavonni a változtatásaidat";

/* Replace-button in ask-if-sure-you-want-to-replace-in-advanced-find-sheet */
"Replace" = "Cserél";

/* Indicate that we replaced %i occurrences of %@ with %@ in update-search-textField-after-replace */
"Replaced %i occurrences of %@ with %@" = "%1$i alkalommal a(z) “%2$@” kifejezést a(z) “%3$@” kifejezésre cseréltem";

/* Indicate that we replaced one occurrence of %@ with %@ in update-search-textField-after-replace */
"Replaced one occurrence of %@ with %@" = "A(z) “%1$@” kifejezést a(z) “%2$@” kifejezésre cseréltem";

/* Revert-button in Revert-sheet */
"Revert" = "Visszaállítás";

/* Save */
"Save" = "Mentés";

/* Selection, in the status bar */
"Selection" = "Kiválasztás";

/* Show Documents List in View menu */
"Show Documents List" = "Dokumentum lista megjelenítése";

/* Show Invisible Characters in View-menu */
"Show Invisible Characters" = "Láthatatlan karakterek megjelenítése";

/* Show Line Numbers */
"Show Line Numbers" = "Sorszámok megjelenítése";

/* Show Projects toolbar item Label */
"Show Projects" = "Projektek megjelenítése";

/* Show Projects Drawer in View menu */
"Show Projects Drawer" = "Projekt fiók megjelenítése";

/* Show Status Bar in View-menu */
"Show Status Bar" = "Állapot sor megjelenítése";

/* Show Syntax Colours */
"Show Syntax Colours" = "Szintaxis szinezés";

/* Show Tab Bar in View menu */
"Show Tab Bar" = "Tabok megjelenítése";

/* Show/Hide Line Numbers toolbar item Palette Label */
"Show/Hide Line Numbers" = "Sorszámok megjelenítése/elrejtése";

/* Show/Hide Projects toolbar item Palette Label */
"Show/Hide Projects" = "Projektek megjelenítése/elrejtése";

/* Show/Hide Syntax Colours toolbar item Palette Label */
"Show/Hide Syntax Colours" = "Szintaxis színezés megjelenítése/elrejtése";

/* Snippets */
"Snippets" = "Snippetek";

/* Split Window */
"Split Window" = "Ablak osztása";

/* Split Window / Close Split toolbar item Palette Label */
"Split Window / Close Split" = "Ablak osztása / osztás megszüntetése";

/* Syntax, in the status bar */
"Syntax" = "Szintaxis";

/* Syntax colours preferences toolbar item Label */
"Syntax Colours" = "Szintaxis szinek";

/* Syntax definitions preferences toolbar item Label */
"Syntax Definitions" = "Szintaxis definíciók";

/* Text File-button in Ask-if-project-or-file sheet */
"Text File" = "Szövegfile";

/* Indicate that the document %@ has been updated by another application in Document-has-been-updated-alert sheet */
"The document %@ has been updated by another application" = "A(z) “%@” dokumentumot frissítette egy másik program";

/* Indicate in Close-sheet that the document %@ has not been saved. */
"The document %@ has not been saved" = "A(z) “%@” dokumentum nem lett elmentve";

/* Indicate that the document %@ is no longer open in Document-is-no-longer-opened-after-selection-in-advanced-find-sheet */
"The document %@ is no longer open" = "A(z) “%@” dokumentum nincs már nyitva";

/* Indicate that the file %@ does not exist Open-file-does-not-exist sheet */
"The file %@ does not exist" = "A(z) “%@” file nem létezik";

/* Indicate that there was a problem opening the document with the encoding %@. And ask if you want to open it anyway? */
"There was a problem opening the document with the encoding %@. Do you want to try to open it anyway?" = "Valami probléma volt a dokumentum “%@” kódolással való megnyitása közben. Mégis megnyissam?";

/* Indicate that there was a unknown error when trying to install the command-linbe utility in Unknown-error-when-installing-comman-line-utility sheet */
"There was a unknown error when trying to install the command-line utility" = "Ismeretlen hiba lépett fel a parancssori eszközök telepítése közben";

/* Indicate that there was a unknown error when trying to open the file %@ with authentication in Unknown-error-when-opening-with-authentication sheet */
"There was a unknown error when trying to open the file %@ with authentication" = "A(z) “%@” file megnyitása közben ismeretlen hiba lépett fel";

/* Indicate that there was a unknown error when trying to save the file %@ in Unknown-error-when-saving sheet */
"There was a unknown error when trying to save the file %@" = "A(z) “%@” file mentése közben ismeretlen hiba lépett fel";

/* Indicate that there was a unknown error when trying to save the file %@ with authentication in Unknown-error-when-saving-with-authentication sheet */
"There was a unknown error when trying to save the file %@ with authentication" = "A(z) “%@” file mentése közben ismeretlen hiba lépett fel";

/* This message will NOT appear again so try to remember it:-) in Show Document In Full Screen */
"This message will NOT appear again so try to remember it:-)" = "Ez a hiba többször nem fog megjelenni, úgyhogy próbáld meg megjegyezni! :-)";

/* This will delete all snippets that exists in the collection %@. Are you sure you want to continue? when deleting a collection */
"This will delete all snippets that exists in the collection %@. Are you sure you want to continue?" = "Ez minden snippetet törölni fog a(z) “%@” gyüjteményben. Biztos, hogy folytatod?";

/* Unknown error when running the command in performCommand */
"Unknown error when running the command" = "Ismeretlen hiba történt a parancs végrehajtása közben";

/* Name for untitled document */
"untitled" = "névtelen";

/* Untitled project */
"Untitled project" = "Névtelen projekt";

/* Upload-button in Upload-preferences-to-iDisk sheet */
"Upload" = "Feltöltés";

/* Use settings from Preferences in openAction */
"Use settings from Preferences" = "A helyi beállításokat használom";

/* Indicate that you can not save this file because %@ is now a folder */
"You can not save this file because %@ is now a folder" = "Nem tudod elmenteni a(z) “%@” dokumentumot, mert az egy könyvtár";

/* Indicate that you cannot open %@ because it is a folder in Open-file-is-a-directory sheet */
"You cannot open %@ because it is a folder" = "Nem tudod megnyithatni a(z) “%@” dokumentumot, mert az egy könyvtár";

/* Indicate that you cannot revert this document because the file %@ doesn't exist anymore Revert-file-doesn't-exist sheet */
"You cannot revert this document because the file %@ doesn't exist anymore" = "Nem állíthatod vissza a(z) “%@” dokumentumot, mert nem létezik már";

/* Indicate that they have set the preferences to not show anything in the status bar in Show-status-bar-action */
"You have set the preferences to not show anything in the status bar" = "Azt állítottad be, hogy ne jelenjen meg semmi az állapotsorban";

/* You need Mac OS X 10.4.5 Tiger or later to run this version of Smultron in Check-system-version */
"You need Mac OS X 10.4.5 Tiger or later to run this version of Smultron" = "Mac OS X 10.4.5 Tiger, vagy újabb verzióra van szükséged a Smultron ezen verziójának a futtatásához";

/* Your changes will be lost if you close the document without saving in Close-sheet */
"Your changes will be lost if you close the document without saving." = "Változásaid elvesznek, ha mentés nélkül bezárod a dokumentumot";

/* Warn that changes will be lost if you revert in Revert-sheet */
"Your changes will be lost if you revert the document" = "Változtatásaid elvesznek, ha visszaállítod a dokumentumot";

